// 1. Создать переменную и спросить у пользователя “Ваш
// возраст”.
// 2. Вывести на экран текст. Вам “возраст пользователя” лет.
// 3. Спросить у пользователя его имя.
// 4. Вывести на экран, Добро пожаловать на сайт “Имя
// пользователя”.

// let userAge = prompt("Ваш возраст?");
// alert(`Вам ${userAge} лет`);

// let userName = prompt("Ваше имя?");
// alert(`Добро пожаловать на сайт, ${userName}`);

// 1. Найти остаток от деления двух переменных
//      a. let a = 13;
//      b. let b = 5;
// 2. Что выведет на экран (Сначала проговорите, потом проверьте)
//      a. let a;
//      b. alert(a);   // undefined
// 3. Что выведет на экран (Сначала проговорите, потом проверьте)
//      a. alert('abc' * 3);    // NaN
// 4. Что выведет на экран (Сначала проговорите, потом проверьте)
//      a. alert( 1 / 0);      // Infinity
//      b. alert(-1 / 0);      // -Infinity
// 5. Что выведет на экран (Сначала проговорите, потом проверьте)
//      a. alert('2' * '3');

// let a = 13;
// let b = 5;
// console.log(a % b);

// 1. Необходимо вывести в консоль результат суммы данных
// переменных
//      a. let a = '2';
//      b. let b = '3';
// 2. Пользователь с клавиатуры вводит 2 числа, необходимо в консоль
// вывести текст
//      a. Сумма чисел равна “результат”
//      b. Разность чисел равна “результат”
//      c. Произведение чисел равно “результат”
//      d. Частное чисел равно “результат”
//      e. Остаток от деления чисел равен “результат”

let a = '2';
let b = '3';
console.log(parseInt(a) + parseInt(b));
// console.log(Number(a) + Number(b));
// a = Number(a);
// b = Number(b);

